{
  "vocab_size": 326,
  "special_tokens": {
    "[CLS]": 0,
    "[SEP]": 1,
    "[MASK]": 2,
    "[PAD]": 3,
    "[DROPPED]": 4,
    "[SEQ_START]": 5,
    "[STRUCT_START]": 6,
    "[CONS_START]": 7,
    "[GO_START]": 8
  },
  "modality_offsets": {
    "sequence": 9,
    "ss": 16,
    "consensus": 32,
    "go_terms": 44
  },
  "modality_vocabs": {
    "sequence": [
      "A",
      "C",
      "G",
      "U",
      "N",
      "[RNA-UNK]",
      "[SEQ-GAP]"
    ],
    "ss": [
      "(",
      ")",
      ".",
      "<",
      ">",
      "[",
      "]",
      "{",
      "}",
      ":",
      "~",
      "-",
      "_",
      ",",
      "[STRUC-UNK]",
      "[STRUC-GAP]"
    ],
    "consensus": [
      "A",
      "C",
      "G",
      "U",
      "a",
      "c",
      "g",
      "u",
      ".",
      "~",
      "[CONS-UNK]",
      "[CONS-GAP]"
    ],
    "go_terms": [
      "[GO-UNK]",
      "[GO-GAP]",
      "GO:0005515",
      "GO:0006730",
      "GO:0015797",
      "GO:0006401",
      "GO:0060548",
      "GO:0005693",
      "GO:0009088",
      "GO:0006452",
      "GO:0031123",
      "GO:0009372",
      "GO:0007298",
      "GO:0000171",
      "GO:0005786",
      "GO:0005840",
      "GO:0071234",
      "GO:0031369",
      "GO:0045727",
      "GO:0006099",
      "GO:1901359",
      "GO:1900191",
      "GO:0043629",
      "GO:0010608",
      "GO:0030371",
      "GO:0009407",
      "GO:2000648",
      "GO:0110001",
      "GO:0005682",
      "GO:0061014",
      "GO:0032026",
      "GO:0009085",
      "GO:0006521",
      "GO:0036386",
      "GO:0000049",
      "GO:0000348",
      "GO:0002060",
      "GO:0010468",
      "GO:0006520",
      "GO:0006113",
      "GO:1904973",
      "GO:0006952",
      "GO:2001126",
      "GO:0070406",
      "GO:0003729",
      "GO:0070063",
      "GO:0051168",
      "GO:0000900",
      "GO:0043022",
      "GO:0051701",
      "GO:0043158",
      "GO:0042542",
      "GO:0045596",
      "GO:0001708",
      "GO:0010467",
      "GO:0030488",
      "GO:0005685",
      "GO:0032197",
      "GO:0075139",
      "GO:1900371",
      "GO:0051090",
      "GO:0046336",
      "GO:0009399",
      "GO:0044403",
      "GO:0039694",
      "GO:0039703",
      "GO:0001514",
      "GO:0030622",
      "GO:0009877",
      "GO:0030624",
      "GO:0045947",
      "GO:0060041",
      "GO:1902680",
      "GO:0005688",
      "GO:0006955",
      "GO:0046536",
      "GO:1900017",
      "GO:0046872",
      "GO:0007605",
      "GO:0000373",
      "GO:0048255",
      "GO:0006417",
      "GO:0071391",
      "GO:0046677",
      "GO:0010042",
      "GO:0000172",
      "GO:0048027",
      "GO:0009113",
      "GO:0009408",
      "GO:0060291",
      "GO:0031402",
      "GO:0016032",
      "GO:0042382",
      "GO:0000289",
      "GO:0071480",
      "GO:0008150",
      "GO:0051169",
      "GO:1902679",
      "GO:0003723",
      "GO:0006412",
      "GO:0035438",
      "GO:0007004",
      "GO:0071230",
      "GO:0060908",
      "GO:0006446",
      "GO:0019856",
      "GO:0043066",
      "GO:0044650",
      "GO:1902617",
      "GO:0001896",
      "GO:0046661",
      "GO:0015855",
      "GO:0046660",
      "GO:0046500",
      "GO:0000333",
      "GO:0080183",
      "GO:0009048",
      "GO:0071260",
      "GO:0005687",
      "GO:0097311",
      "GO:0031556",
      "GO:1901698",
      "GO:0005575",
      "GO:0010181",
      "GO:0031047",
      "GO:0008595",
      "GO:0015976",
      "GO:0039705",
      "GO:0005634",
      "GO:0004526",
      "GO:0017148",
      "GO:0045013",
      "GO:0003743",
      "GO:0046498",
      "GO:0035195",
      "GO:0048501",
      "GO:0006396",
      "GO:0007391",
      "GO:0031554",
      "GO:0071333",
      "GO:0039580",
      "GO:0035194",
      "GO:0015030",
      "GO:0071732",
      "GO:0009267",
      "GO:0008616",
      "GO:0022610",
      "GO:0010629",
      "GO:0000105",
      "GO:0008298",
      "GO:1990830",
      "GO:0019079",
      "GO:1900376",
      "GO:0010628",
      "GO:2000145",
      "GO:0046653",
      "GO:0019080",
      "GO:0045814",
      "GO:0003323",
      "GO:1904322",
      "GO:0090729",
      "GO:0009299",
      "GO:0005623",
      "GO:0003824",
      "GO:0180001",
      "GO:0030627",
      "GO:0000353",
      "GO:0051819",
      "GO:0032774",
      "GO:0043555",
      "GO:0005690",
      "GO:1903295",
      "GO:0003735",
      "GO:1900363",
      "GO:0035278",
      "GO:0075523",
      "GO:0017070",
      "GO:0030145",
      "GO:0000395",
      "GO:0045182",
      "GO:0019074",
      "GO:0050779",
      "GO:0061157",
      "GO:0045892",
      "GO:0010109",
      "GO:0032057",
      "GO:0045599",
      "GO:0009617",
      "GO:0071978",
      "GO:0006109",
      "GO:0006382",
      "GO:0045131",
      "GO:0001745",
      "GO:0003720",
      "GO:0030681",
      "GO:0045974",
      "GO:0045975",
      "GO:0008049",
      "GO:0016607",
      "GO:1900268",
      "GO:0005730",
      "GO:0030680",
      "GO:0030631",
      "GO:0060259",
      "GO:0004478",
      "GO:0042478",
      "GO:0071241",
      "GO:0071222",
      "GO:0006413",
      "GO:0010039",
      "GO:0019069",
      "GO:0003676",
      "GO:0043484",
      "GO:0009098",
      "GO:0006338",
      "GO:0046782",
      "GO:0016055",
      "GO:0005737",
      "GO:0016442",
      "GO:0043934",
      "GO:0030533",
      "GO:0008359",
      "GO:0008033",
      "GO:0045893",
      "GO:0030151",
      "GO:0042981",
      "GO:0043488",
      "GO:0006403",
      "GO:0030647",
      "GO:0008258",
      "GO:0050897",
      "GO:0007569",
      "GO:0039689",
      "GO:0030900",
      "GO:0034198",
      "GO:0019081",
      "GO:0006545",
      "GO:0005686",
      "GO:0042868",
      "GO:0043590",
      "GO:0005691",
      "GO:0051726",
      "GO:0019072",
      "GO:0042749",
      "GO:0030976",
      "GO:0051028",
      "GO:0060910",
      "GO:0006364",
      "GO:0032546",
      "GO:2000147",
      "GO:0004540",
      "GO:0030621",
      "GO:0030308",
      "GO:0046540",
      "GO:0046549",
      "GO:0000244",
      "GO:0055065",
      "GO:0040033",
      "GO:0006617",
      "GO:0050728",
      "GO:0005739",
      "GO:0000162",
      "GO:0070482",
      "GO:0019044",
      "GO:0035094",
      "GO:0045069",
      "GO:0003674",
      "GO:0006398",
      "GO:0045451",
      "GO:0006979",
      "GO:0031507",
      "GO:0032055",
      "GO:0035282",
      "GO:0031419",
      "GO:0045786",
      "GO:0014850",
      "GO:0006353",
      "GO:0005692",
      "GO:0000365",
      "GO:0009266",
      "GO:0036294",
      "GO:0043487"
    ]
  },
  "global_to_local": {
    "0": [
      "[CLS]",
      "special"
    ],
    "1": [
      "[SEP]",
      "special"
    ],
    "2": [
      "[MASK]",
      "special"
    ],
    "3": [
      "[PAD]",
      "special"
    ],
    "4": [
      "[DROPPED]",
      "special"
    ],
    "5": [
      "[SEQ_START]",
      "special"
    ],
    "6": [
      "[STRUCT_START]",
      "special"
    ],
    "7": [
      "[CONS_START]",
      "special"
    ],
    "8": [
      "[GO_START]",
      "special"
    ],
    "9": [
      "A",
      "sequence"
    ],
    "10": [
      "C",
      "sequence"
    ],
    "11": [
      "G",
      "sequence"
    ],
    "12": [
      "U",
      "sequence"
    ],
    "13": [
      "N",
      "sequence"
    ],
    "14": [
      "[RNA-UNK]",
      "sequence"
    ],
    "15": [
      "[SEQ-GAP]",
      "sequence"
    ],
    "16": [
      "(",
      "ss"
    ],
    "17": [
      ")",
      "ss"
    ],
    "18": [
      ".",
      "ss"
    ],
    "19": [
      "<",
      "ss"
    ],
    "20": [
      ">",
      "ss"
    ],
    "21": [
      "[",
      "ss"
    ],
    "22": [
      "]",
      "ss"
    ],
    "23": [
      "{",
      "ss"
    ],
    "24": [
      "}",
      "ss"
    ],
    "25": [
      ":",
      "ss"
    ],
    "26": [
      "~",
      "ss"
    ],
    "27": [
      "-",
      "ss"
    ],
    "28": [
      "_",
      "ss"
    ],
    "29": [
      ",",
      "ss"
    ],
    "30": [
      "[STRUC-UNK]",
      "ss"
    ],
    "31": [
      "[STRUC-GAP]",
      "ss"
    ],
    "32": [
      "A",
      "consensus"
    ],
    "33": [
      "C",
      "consensus"
    ],
    "34": [
      "G",
      "consensus"
    ],
    "35": [
      "U",
      "consensus"
    ],
    "36": [
      "a",
      "consensus"
    ],
    "37": [
      "c",
      "consensus"
    ],
    "38": [
      "g",
      "consensus"
    ],
    "39": [
      "u",
      "consensus"
    ],
    "40": [
      ".",
      "consensus"
    ],
    "41": [
      "~",
      "consensus"
    ],
    "42": [
      "[CONS-UNK]",
      "consensus"
    ],
    "43": [
      "[CONS-GAP]",
      "consensus"
    ],
    "44": [
      "[GO-UNK]",
      "go_terms"
    ],
    "45": [
      "[GO-GAP]",
      "go_terms"
    ],
    "46": [
      "GO:0005515",
      "go_terms"
    ],
    "47": [
      "GO:0006730",
      "go_terms"
    ],
    "48": [
      "GO:0015797",
      "go_terms"
    ],
    "49": [
      "GO:0006401",
      "go_terms"
    ],
    "50": [
      "GO:0060548",
      "go_terms"
    ],
    "51": [
      "GO:0005693",
      "go_terms"
    ],
    "52": [
      "GO:0009088",
      "go_terms"
    ],
    "53": [
      "GO:0006452",
      "go_terms"
    ],
    "54": [
      "GO:0031123",
      "go_terms"
    ],
    "55": [
      "GO:0009372",
      "go_terms"
    ],
    "56": [
      "GO:0007298",
      "go_terms"
    ],
    "57": [
      "GO:0000171",
      "go_terms"
    ],
    "58": [
      "GO:0005786",
      "go_terms"
    ],
    "59": [
      "GO:0005840",
      "go_terms"
    ],
    "60": [
      "GO:0071234",
      "go_terms"
    ],
    "61": [
      "GO:0031369",
      "go_terms"
    ],
    "62": [
      "GO:0045727",
      "go_terms"
    ],
    "63": [
      "GO:0006099",
      "go_terms"
    ],
    "64": [
      "GO:1901359",
      "go_terms"
    ],
    "65": [
      "GO:1900191",
      "go_terms"
    ],
    "66": [
      "GO:0043629",
      "go_terms"
    ],
    "67": [
      "GO:0010608",
      "go_terms"
    ],
    "68": [
      "GO:0030371",
      "go_terms"
    ],
    "69": [
      "GO:0009407",
      "go_terms"
    ],
    "70": [
      "GO:2000648",
      "go_terms"
    ],
    "71": [
      "GO:0110001",
      "go_terms"
    ],
    "72": [
      "GO:0005682",
      "go_terms"
    ],
    "73": [
      "GO:0061014",
      "go_terms"
    ],
    "74": [
      "GO:0032026",
      "go_terms"
    ],
    "75": [
      "GO:0009085",
      "go_terms"
    ],
    "76": [
      "GO:0006521",
      "go_terms"
    ],
    "77": [
      "GO:0036386",
      "go_terms"
    ],
    "78": [
      "GO:0000049",
      "go_terms"
    ],
    "79": [
      "GO:0000348",
      "go_terms"
    ],
    "80": [
      "GO:0002060",
      "go_terms"
    ],
    "81": [
      "GO:0010468",
      "go_terms"
    ],
    "82": [
      "GO:0006520",
      "go_terms"
    ],
    "83": [
      "GO:0006113",
      "go_terms"
    ],
    "84": [
      "GO:1904973",
      "go_terms"
    ],
    "85": [
      "GO:0006952",
      "go_terms"
    ],
    "86": [
      "GO:2001126",
      "go_terms"
    ],
    "87": [
      "GO:0070406",
      "go_terms"
    ],
    "88": [
      "GO:0003729",
      "go_terms"
    ],
    "89": [
      "GO:0070063",
      "go_terms"
    ],
    "90": [
      "GO:0051168",
      "go_terms"
    ],
    "91": [
      "GO:0000900",
      "go_terms"
    ],
    "92": [
      "GO:0043022",
      "go_terms"
    ],
    "93": [
      "GO:0051701",
      "go_terms"
    ],
    "94": [
      "GO:0043158",
      "go_terms"
    ],
    "95": [
      "GO:0042542",
      "go_terms"
    ],
    "96": [
      "GO:0045596",
      "go_terms"
    ],
    "97": [
      "GO:0001708",
      "go_terms"
    ],
    "98": [
      "GO:0010467",
      "go_terms"
    ],
    "99": [
      "GO:0030488",
      "go_terms"
    ],
    "100": [
      "GO:0005685",
      "go_terms"
    ],
    "101": [
      "GO:0032197",
      "go_terms"
    ],
    "102": [
      "GO:0075139",
      "go_terms"
    ],
    "103": [
      "GO:1900371",
      "go_terms"
    ],
    "104": [
      "GO:0051090",
      "go_terms"
    ],
    "105": [
      "GO:0046336",
      "go_terms"
    ],
    "106": [
      "GO:0009399",
      "go_terms"
    ],
    "107": [
      "GO:0044403",
      "go_terms"
    ],
    "108": [
      "GO:0039694",
      "go_terms"
    ],
    "109": [
      "GO:0039703",
      "go_terms"
    ],
    "110": [
      "GO:0001514",
      "go_terms"
    ],
    "111": [
      "GO:0030622",
      "go_terms"
    ],
    "112": [
      "GO:0009877",
      "go_terms"
    ],
    "113": [
      "GO:0030624",
      "go_terms"
    ],
    "114": [
      "GO:0045947",
      "go_terms"
    ],
    "115": [
      "GO:0060041",
      "go_terms"
    ],
    "116": [
      "GO:1902680",
      "go_terms"
    ],
    "117": [
      "GO:0005688",
      "go_terms"
    ],
    "118": [
      "GO:0006955",
      "go_terms"
    ],
    "119": [
      "GO:0046536",
      "go_terms"
    ],
    "120": [
      "GO:1900017",
      "go_terms"
    ],
    "121": [
      "GO:0046872",
      "go_terms"
    ],
    "122": [
      "GO:0007605",
      "go_terms"
    ],
    "123": [
      "GO:0000373",
      "go_terms"
    ],
    "124": [
      "GO:0048255",
      "go_terms"
    ],
    "125": [
      "GO:0006417",
      "go_terms"
    ],
    "126": [
      "GO:0071391",
      "go_terms"
    ],
    "127": [
      "GO:0046677",
      "go_terms"
    ],
    "128": [
      "GO:0010042",
      "go_terms"
    ],
    "129": [
      "GO:0000172",
      "go_terms"
    ],
    "130": [
      "GO:0048027",
      "go_terms"
    ],
    "131": [
      "GO:0009113",
      "go_terms"
    ],
    "132": [
      "GO:0009408",
      "go_terms"
    ],
    "133": [
      "GO:0060291",
      "go_terms"
    ],
    "134": [
      "GO:0031402",
      "go_terms"
    ],
    "135": [
      "GO:0016032",
      "go_terms"
    ],
    "136": [
      "GO:0042382",
      "go_terms"
    ],
    "137": [
      "GO:0000289",
      "go_terms"
    ],
    "138": [
      "GO:0071480",
      "go_terms"
    ],
    "139": [
      "GO:0008150",
      "go_terms"
    ],
    "140": [
      "GO:0051169",
      "go_terms"
    ],
    "141": [
      "GO:1902679",
      "go_terms"
    ],
    "142": [
      "GO:0003723",
      "go_terms"
    ],
    "143": [
      "GO:0006412",
      "go_terms"
    ],
    "144": [
      "GO:0035438",
      "go_terms"
    ],
    "145": [
      "GO:0007004",
      "go_terms"
    ],
    "146": [
      "GO:0071230",
      "go_terms"
    ],
    "147": [
      "GO:0060908",
      "go_terms"
    ],
    "148": [
      "GO:0006446",
      "go_terms"
    ],
    "149": [
      "GO:0019856",
      "go_terms"
    ],
    "150": [
      "GO:0043066",
      "go_terms"
    ],
    "151": [
      "GO:0044650",
      "go_terms"
    ],
    "152": [
      "GO:1902617",
      "go_terms"
    ],
    "153": [
      "GO:0001896",
      "go_terms"
    ],
    "154": [
      "GO:0046661",
      "go_terms"
    ],
    "155": [
      "GO:0015855",
      "go_terms"
    ],
    "156": [
      "GO:0046660",
      "go_terms"
    ],
    "157": [
      "GO:0046500",
      "go_terms"
    ],
    "158": [
      "GO:0000333",
      "go_terms"
    ],
    "159": [
      "GO:0080183",
      "go_terms"
    ],
    "160": [
      "GO:0009048",
      "go_terms"
    ],
    "161": [
      "GO:0071260",
      "go_terms"
    ],
    "162": [
      "GO:0005687",
      "go_terms"
    ],
    "163": [
      "GO:0097311",
      "go_terms"
    ],
    "164": [
      "GO:0031556",
      "go_terms"
    ],
    "165": [
      "GO:1901698",
      "go_terms"
    ],
    "166": [
      "GO:0005575",
      "go_terms"
    ],
    "167": [
      "GO:0010181",
      "go_terms"
    ],
    "168": [
      "GO:0031047",
      "go_terms"
    ],
    "169": [
      "GO:0008595",
      "go_terms"
    ],
    "170": [
      "GO:0015976",
      "go_terms"
    ],
    "171": [
      "GO:0039705",
      "go_terms"
    ],
    "172": [
      "GO:0005634",
      "go_terms"
    ],
    "173": [
      "GO:0004526",
      "go_terms"
    ],
    "174": [
      "GO:0017148",
      "go_terms"
    ],
    "175": [
      "GO:0045013",
      "go_terms"
    ],
    "176": [
      "GO:0003743",
      "go_terms"
    ],
    "177": [
      "GO:0046498",
      "go_terms"
    ],
    "178": [
      "GO:0035195",
      "go_terms"
    ],
    "179": [
      "GO:0048501",
      "go_terms"
    ],
    "180": [
      "GO:0006396",
      "go_terms"
    ],
    "181": [
      "GO:0007391",
      "go_terms"
    ],
    "182": [
      "GO:0031554",
      "go_terms"
    ],
    "183": [
      "GO:0071333",
      "go_terms"
    ],
    "184": [
      "GO:0039580",
      "go_terms"
    ],
    "185": [
      "GO:0035194",
      "go_terms"
    ],
    "186": [
      "GO:0015030",
      "go_terms"
    ],
    "187": [
      "GO:0071732",
      "go_terms"
    ],
    "188": [
      "GO:0009267",
      "go_terms"
    ],
    "189": [
      "GO:0008616",
      "go_terms"
    ],
    "190": [
      "GO:0022610",
      "go_terms"
    ],
    "191": [
      "GO:0010629",
      "go_terms"
    ],
    "192": [
      "GO:0000105",
      "go_terms"
    ],
    "193": [
      "GO:0008298",
      "go_terms"
    ],
    "194": [
      "GO:1990830",
      "go_terms"
    ],
    "195": [
      "GO:0019079",
      "go_terms"
    ],
    "196": [
      "GO:1900376",
      "go_terms"
    ],
    "197": [
      "GO:0010628",
      "go_terms"
    ],
    "198": [
      "GO:2000145",
      "go_terms"
    ],
    "199": [
      "GO:0046653",
      "go_terms"
    ],
    "200": [
      "GO:0019080",
      "go_terms"
    ],
    "201": [
      "GO:0045814",
      "go_terms"
    ],
    "202": [
      "GO:0003323",
      "go_terms"
    ],
    "203": [
      "GO:1904322",
      "go_terms"
    ],
    "204": [
      "GO:0090729",
      "go_terms"
    ],
    "205": [
      "GO:0009299",
      "go_terms"
    ],
    "206": [
      "GO:0005623",
      "go_terms"
    ],
    "207": [
      "GO:0003824",
      "go_terms"
    ],
    "208": [
      "GO:0180001",
      "go_terms"
    ],
    "209": [
      "GO:0030627",
      "go_terms"
    ],
    "210": [
      "GO:0000353",
      "go_terms"
    ],
    "211": [
      "GO:0051819",
      "go_terms"
    ],
    "212": [
      "GO:0032774",
      "go_terms"
    ],
    "213": [
      "GO:0043555",
      "go_terms"
    ],
    "214": [
      "GO:0005690",
      "go_terms"
    ],
    "215": [
      "GO:1903295",
      "go_terms"
    ],
    "216": [
      "GO:0003735",
      "go_terms"
    ],
    "217": [
      "GO:1900363",
      "go_terms"
    ],
    "218": [
      "GO:0035278",
      "go_terms"
    ],
    "219": [
      "GO:0075523",
      "go_terms"
    ],
    "220": [
      "GO:0017070",
      "go_terms"
    ],
    "221": [
      "GO:0030145",
      "go_terms"
    ],
    "222": [
      "GO:0000395",
      "go_terms"
    ],
    "223": [
      "GO:0045182",
      "go_terms"
    ],
    "224": [
      "GO:0019074",
      "go_terms"
    ],
    "225": [
      "GO:0050779",
      "go_terms"
    ],
    "226": [
      "GO:0061157",
      "go_terms"
    ],
    "227": [
      "GO:0045892",
      "go_terms"
    ],
    "228": [
      "GO:0010109",
      "go_terms"
    ],
    "229": [
      "GO:0032057",
      "go_terms"
    ],
    "230": [
      "GO:0045599",
      "go_terms"
    ],
    "231": [
      "GO:0009617",
      "go_terms"
    ],
    "232": [
      "GO:0071978",
      "go_terms"
    ],
    "233": [
      "GO:0006109",
      "go_terms"
    ],
    "234": [
      "GO:0006382",
      "go_terms"
    ],
    "235": [
      "GO:0045131",
      "go_terms"
    ],
    "236": [
      "GO:0001745",
      "go_terms"
    ],
    "237": [
      "GO:0003720",
      "go_terms"
    ],
    "238": [
      "GO:0030681",
      "go_terms"
    ],
    "239": [
      "GO:0045974",
      "go_terms"
    ],
    "240": [
      "GO:0045975",
      "go_terms"
    ],
    "241": [
      "GO:0008049",
      "go_terms"
    ],
    "242": [
      "GO:0016607",
      "go_terms"
    ],
    "243": [
      "GO:1900268",
      "go_terms"
    ],
    "244": [
      "GO:0005730",
      "go_terms"
    ],
    "245": [
      "GO:0030680",
      "go_terms"
    ],
    "246": [
      "GO:0030631",
      "go_terms"
    ],
    "247": [
      "GO:0060259",
      "go_terms"
    ],
    "248": [
      "GO:0004478",
      "go_terms"
    ],
    "249": [
      "GO:0042478",
      "go_terms"
    ],
    "250": [
      "GO:0071241",
      "go_terms"
    ],
    "251": [
      "GO:0071222",
      "go_terms"
    ],
    "252": [
      "GO:0006413",
      "go_terms"
    ],
    "253": [
      "GO:0010039",
      "go_terms"
    ],
    "254": [
      "GO:0019069",
      "go_terms"
    ],
    "255": [
      "GO:0003676",
      "go_terms"
    ],
    "256": [
      "GO:0043484",
      "go_terms"
    ],
    "257": [
      "GO:0009098",
      "go_terms"
    ],
    "258": [
      "GO:0006338",
      "go_terms"
    ],
    "259": [
      "GO:0046782",
      "go_terms"
    ],
    "260": [
      "GO:0016055",
      "go_terms"
    ],
    "261": [
      "GO:0005737",
      "go_terms"
    ],
    "262": [
      "GO:0016442",
      "go_terms"
    ],
    "263": [
      "GO:0043934",
      "go_terms"
    ],
    "264": [
      "GO:0030533",
      "go_terms"
    ],
    "265": [
      "GO:0008359",
      "go_terms"
    ],
    "266": [
      "GO:0008033",
      "go_terms"
    ],
    "267": [
      "GO:0045893",
      "go_terms"
    ],
    "268": [
      "GO:0030151",
      "go_terms"
    ],
    "269": [
      "GO:0042981",
      "go_terms"
    ],
    "270": [
      "GO:0043488",
      "go_terms"
    ],
    "271": [
      "GO:0006403",
      "go_terms"
    ],
    "272": [
      "GO:0030647",
      "go_terms"
    ],
    "273": [
      "GO:0008258",
      "go_terms"
    ],
    "274": [
      "GO:0050897",
      "go_terms"
    ],
    "275": [
      "GO:0007569",
      "go_terms"
    ],
    "276": [
      "GO:0039689",
      "go_terms"
    ],
    "277": [
      "GO:0030900",
      "go_terms"
    ],
    "278": [
      "GO:0034198",
      "go_terms"
    ],
    "279": [
      "GO:0019081",
      "go_terms"
    ],
    "280": [
      "GO:0006545",
      "go_terms"
    ],
    "281": [
      "GO:0005686",
      "go_terms"
    ],
    "282": [
      "GO:0042868",
      "go_terms"
    ],
    "283": [
      "GO:0043590",
      "go_terms"
    ],
    "284": [
      "GO:0005691",
      "go_terms"
    ],
    "285": [
      "GO:0051726",
      "go_terms"
    ],
    "286": [
      "GO:0019072",
      "go_terms"
    ],
    "287": [
      "GO:0042749",
      "go_terms"
    ],
    "288": [
      "GO:0030976",
      "go_terms"
    ],
    "289": [
      "GO:0051028",
      "go_terms"
    ],
    "290": [
      "GO:0060910",
      "go_terms"
    ],
    "291": [
      "GO:0006364",
      "go_terms"
    ],
    "292": [
      "GO:0032546",
      "go_terms"
    ],
    "293": [
      "GO:2000147",
      "go_terms"
    ],
    "294": [
      "GO:0004540",
      "go_terms"
    ],
    "295": [
      "GO:0030621",
      "go_terms"
    ],
    "296": [
      "GO:0030308",
      "go_terms"
    ],
    "297": [
      "GO:0046540",
      "go_terms"
    ],
    "298": [
      "GO:0046549",
      "go_terms"
    ],
    "299": [
      "GO:0000244",
      "go_terms"
    ],
    "300": [
      "GO:0055065",
      "go_terms"
    ],
    "301": [
      "GO:0040033",
      "go_terms"
    ],
    "302": [
      "GO:0006617",
      "go_terms"
    ],
    "303": [
      "GO:0050728",
      "go_terms"
    ],
    "304": [
      "GO:0005739",
      "go_terms"
    ],
    "305": [
      "GO:0000162",
      "go_terms"
    ],
    "306": [
      "GO:0070482",
      "go_terms"
    ],
    "307": [
      "GO:0019044",
      "go_terms"
    ],
    "308": [
      "GO:0035094",
      "go_terms"
    ],
    "309": [
      "GO:0045069",
      "go_terms"
    ],
    "310": [
      "GO:0003674",
      "go_terms"
    ],
    "311": [
      "GO:0006398",
      "go_terms"
    ],
    "312": [
      "GO:0045451",
      "go_terms"
    ],
    "313": [
      "GO:0006979",
      "go_terms"
    ],
    "314": [
      "GO:0031507",
      "go_terms"
    ],
    "315": [
      "GO:0032055",
      "go_terms"
    ],
    "316": [
      "GO:0035282",
      "go_terms"
    ],
    "317": [
      "GO:0031419",
      "go_terms"
    ],
    "318": [
      "GO:0045786",
      "go_terms"
    ],
    "319": [
      "GO:0014850",
      "go_terms"
    ],
    "320": [
      "GO:0006353",
      "go_terms"
    ],
    "321": [
      "GO:0005692",
      "go_terms"
    ],
    "322": [
      "GO:0000365",
      "go_terms"
    ],
    "323": [
      "GO:0009266",
      "go_terms"
    ],
    "324": [
      "GO:0036294",
      "go_terms"
    ],
    "325": [
      "GO:0043487",
      "go_terms"
    ]
  },
  "local_to_global": {
    "('[CLS]', 'special')": 0,
    "('[SEP]', 'special')": 1,
    "('[MASK]', 'special')": 2,
    "('[PAD]', 'special')": 3,
    "('[DROPPED]', 'special')": 4,
    "('[SEQ_START]', 'special')": 5,
    "('[STRUCT_START]', 'special')": 6,
    "('[CONS_START]', 'special')": 7,
    "('[GO_START]', 'special')": 8,
    "('A', 'sequence')": 9,
    "('C', 'sequence')": 10,
    "('G', 'sequence')": 11,
    "('U', 'sequence')": 12,
    "('N', 'sequence')": 13,
    "('[RNA-UNK]', 'sequence')": 14,
    "('[SEQ-GAP]', 'sequence')": 15,
    "('(', 'ss')": 16,
    "(')', 'ss')": 17,
    "('.', 'ss')": 18,
    "('<', 'ss')": 19,
    "('>', 'ss')": 20,
    "('[', 'ss')": 21,
    "(']', 'ss')": 22,
    "('{', 'ss')": 23,
    "('}', 'ss')": 24,
    "(':', 'ss')": 25,
    "('~', 'ss')": 26,
    "('-', 'ss')": 27,
    "('_', 'ss')": 28,
    "(',', 'ss')": 29,
    "('[STRUC-UNK]', 'ss')": 30,
    "('[STRUC-GAP]', 'ss')": 31,
    "('A', 'consensus')": 32,
    "('C', 'consensus')": 33,
    "('G', 'consensus')": 34,
    "('U', 'consensus')": 35,
    "('a', 'consensus')": 36,
    "('c', 'consensus')": 37,
    "('g', 'consensus')": 38,
    "('u', 'consensus')": 39,
    "('.', 'consensus')": 40,
    "('~', 'consensus')": 41,
    "('[CONS-UNK]', 'consensus')": 42,
    "('[CONS-GAP]', 'consensus')": 43,
    "('[GO-UNK]', 'go_terms')": 44,
    "('[GO-GAP]', 'go_terms')": 45,
    "('special', '[CLS]')": 0,
    "('special', '[SEP]')": 1,
    "('special', '[MASK]')": 2,
    "('special', '[PAD]')": 3,
    "('special', '[DROPPED]')": 4,
    "('special', '[SEQ_START]')": 5,
    "('special', '[STRUCT_START]')": 6,
    "('special', '[CONS_START]')": 7,
    "('special', '[GO_START]')": 8,
    "('sequence', 0)": 9,
    "('sequence', 'A')": 9,
    "('sequence', 1)": 10,
    "('sequence', 'C')": 10,
    "('sequence', 2)": 11,
    "('sequence', 'G')": 11,
    "('sequence', 3)": 12,
    "('sequence', 'U')": 12,
    "('sequence', 4)": 13,
    "('sequence', 'N')": 13,
    "('sequence', 5)": 14,
    "('sequence', '[RNA-UNK]')": 14,
    "('sequence', 6)": 15,
    "('sequence', '[SEQ-GAP]')": 15,
    "('ss', 0)": 16,
    "('ss', '(')": 16,
    "('ss', 1)": 17,
    "('ss', ')')": 17,
    "('ss', 2)": 18,
    "('ss', '.')": 18,
    "('ss', 3)": 19,
    "('ss', '<')": 19,
    "('ss', 4)": 20,
    "('ss', '>')": 20,
    "('ss', 5)": 21,
    "('ss', '[')": 21,
    "('ss', 6)": 22,
    "('ss', ']')": 22,
    "('ss', 7)": 23,
    "('ss', '{')": 23,
    "('ss', 8)": 24,
    "('ss', '}')": 24,
    "('ss', 9)": 25,
    "('ss', ':')": 25,
    "('ss', 10)": 26,
    "('ss', '~')": 26,
    "('ss', 11)": 27,
    "('ss', '-')": 27,
    "('ss', 12)": 28,
    "('ss', '_')": 28,
    "('ss', 13)": 29,
    "('ss', ',')": 29,
    "('ss', 14)": 30,
    "('ss', '[STRUC-UNK]')": 30,
    "('ss', 15)": 31,
    "('ss', '[STRUC-GAP]')": 31,
    "('consensus', 0)": 32,
    "('consensus', 'A')": 32,
    "('consensus', 1)": 33,
    "('consensus', 'C')": 33,
    "('consensus', 2)": 34,
    "('consensus', 'G')": 34,
    "('consensus', 3)": 35,
    "('consensus', 'U')": 35,
    "('consensus', 4)": 36,
    "('consensus', 'a')": 36,
    "('consensus', 5)": 37,
    "('consensus', 'c')": 37,
    "('consensus', 6)": 38,
    "('consensus', 'g')": 38,
    "('consensus', 7)": 39,
    "('consensus', 'u')": 39,
    "('consensus', 8)": 40,
    "('consensus', '.')": 40,
    "('consensus', 9)": 41,
    "('consensus', '~')": 41,
    "('consensus', 10)": 42,
    "('consensus', '[CONS-UNK]')": 42,
    "('consensus', 11)": 43,
    "('consensus', '[CONS-GAP]')": 43,
    "('go_terms', 0)": 44,
    "('go_terms', '[GO-UNK]')": 44,
    "('go_terms', 1)": 45,
    "('go_terms', '[GO-GAP]')": 45,
    "('go_terms', 2)": 46,
    "('go_terms', 'GO:0005515')": 46,
    "('go_terms', 3)": 47,
    "('go_terms', 'GO:0006730')": 47,
    "('go_terms', 4)": 48,
    "('go_terms', 'GO:0015797')": 48,
    "('go_terms', 5)": 49,
    "('go_terms', 'GO:0006401')": 49,
    "('go_terms', 6)": 50,
    "('go_terms', 'GO:0060548')": 50,
    "('go_terms', 7)": 51,
    "('go_terms', 'GO:0005693')": 51,
    "('go_terms', 8)": 52,
    "('go_terms', 'GO:0009088')": 52,
    "('go_terms', 9)": 53,
    "('go_terms', 'GO:0006452')": 53,
    "('go_terms', 10)": 54,
    "('go_terms', 'GO:0031123')": 54,
    "('go_terms', 11)": 55,
    "('go_terms', 'GO:0009372')": 55,
    "('go_terms', 12)": 56,
    "('go_terms', 'GO:0007298')": 56,
    "('go_terms', 13)": 57,
    "('go_terms', 'GO:0000171')": 57,
    "('go_terms', 14)": 58,
    "('go_terms', 'GO:0005786')": 58,
    "('go_terms', 15)": 59,
    "('go_terms', 'GO:0005840')": 59,
    "('go_terms', 16)": 60,
    "('go_terms', 'GO:0071234')": 60,
    "('go_terms', 17)": 61,
    "('go_terms', 'GO:0031369')": 61,
    "('go_terms', 18)": 62,
    "('go_terms', 'GO:0045727')": 62,
    "('go_terms', 19)": 63,
    "('go_terms', 'GO:0006099')": 63,
    "('go_terms', 20)": 64,
    "('go_terms', 'GO:1901359')": 64,
    "('go_terms', 21)": 65,
    "('go_terms', 'GO:1900191')": 65,
    "('go_terms', 22)": 66,
    "('go_terms', 'GO:0043629')": 66,
    "('go_terms', 23)": 67,
    "('go_terms', 'GO:0010608')": 67,
    "('go_terms', 24)": 68,
    "('go_terms', 'GO:0030371')": 68,
    "('go_terms', 25)": 69,
    "('go_terms', 'GO:0009407')": 69,
    "('go_terms', 26)": 70,
    "('go_terms', 'GO:2000648')": 70,
    "('go_terms', 27)": 71,
    "('go_terms', 'GO:0110001')": 71,
    "('go_terms', 28)": 72,
    "('go_terms', 'GO:0005682')": 72,
    "('go_terms', 29)": 73,
    "('go_terms', 'GO:0061014')": 73,
    "('go_terms', 30)": 74,
    "('go_terms', 'GO:0032026')": 74,
    "('go_terms', 31)": 75,
    "('go_terms', 'GO:0009085')": 75,
    "('go_terms', 32)": 76,
    "('go_terms', 'GO:0006521')": 76,
    "('go_terms', 33)": 77,
    "('go_terms', 'GO:0036386')": 77,
    "('go_terms', 34)": 78,
    "('go_terms', 'GO:0000049')": 78,
    "('go_terms', 35)": 79,
    "('go_terms', 'GO:0000348')": 79,
    "('go_terms', 36)": 80,
    "('go_terms', 'GO:0002060')": 80,
    "('go_terms', 37)": 81,
    "('go_terms', 'GO:0010468')": 81,
    "('go_terms', 38)": 82,
    "('go_terms', 'GO:0006520')": 82,
    "('go_terms', 39)": 83,
    "('go_terms', 'GO:0006113')": 83,
    "('go_terms', 40)": 84,
    "('go_terms', 'GO:1904973')": 84,
    "('go_terms', 41)": 85,
    "('go_terms', 'GO:0006952')": 85,
    "('go_terms', 42)": 86,
    "('go_terms', 'GO:2001126')": 86,
    "('go_terms', 43)": 87,
    "('go_terms', 'GO:0070406')": 87,
    "('go_terms', 44)": 88,
    "('go_terms', 'GO:0003729')": 88,
    "('go_terms', 45)": 89,
    "('go_terms', 'GO:0070063')": 89,
    "('go_terms', 46)": 90,
    "('go_terms', 'GO:0051168')": 90,
    "('go_terms', 47)": 91,
    "('go_terms', 'GO:0000900')": 91,
    "('go_terms', 48)": 92,
    "('go_terms', 'GO:0043022')": 92,
    "('go_terms', 49)": 93,
    "('go_terms', 'GO:0051701')": 93,
    "('go_terms', 50)": 94,
    "('go_terms', 'GO:0043158')": 94,
    "('go_terms', 51)": 95,
    "('go_terms', 'GO:0042542')": 95,
    "('go_terms', 52)": 96,
    "('go_terms', 'GO:0045596')": 96,
    "('go_terms', 53)": 97,
    "('go_terms', 'GO:0001708')": 97,
    "('go_terms', 54)": 98,
    "('go_terms', 'GO:0010467')": 98,
    "('go_terms', 55)": 99,
    "('go_terms', 'GO:0030488')": 99,
    "('go_terms', 56)": 100,
    "('go_terms', 'GO:0005685')": 100,
    "('go_terms', 57)": 101,
    "('go_terms', 'GO:0032197')": 101,
    "('go_terms', 58)": 102,
    "('go_terms', 'GO:0075139')": 102,
    "('go_terms', 59)": 103,
    "('go_terms', 'GO:1900371')": 103,
    "('go_terms', 60)": 104,
    "('go_terms', 'GO:0051090')": 104,
    "('go_terms', 61)": 105,
    "('go_terms', 'GO:0046336')": 105,
    "('go_terms', 62)": 106,
    "('go_terms', 'GO:0009399')": 106,
    "('go_terms', 63)": 107,
    "('go_terms', 'GO:0044403')": 107,
    "('go_terms', 64)": 108,
    "('go_terms', 'GO:0039694')": 108,
    "('go_terms', 65)": 109,
    "('go_terms', 'GO:0039703')": 109,
    "('go_terms', 66)": 110,
    "('go_terms', 'GO:0001514')": 110,
    "('go_terms', 67)": 111,
    "('go_terms', 'GO:0030622')": 111,
    "('go_terms', 68)": 112,
    "('go_terms', 'GO:0009877')": 112,
    "('go_terms', 69)": 113,
    "('go_terms', 'GO:0030624')": 113,
    "('go_terms', 70)": 114,
    "('go_terms', 'GO:0045947')": 114,
    "('go_terms', 71)": 115,
    "('go_terms', 'GO:0060041')": 115,
    "('go_terms', 72)": 116,
    "('go_terms', 'GO:1902680')": 116,
    "('go_terms', 73)": 117,
    "('go_terms', 'GO:0005688')": 117,
    "('go_terms', 74)": 118,
    "('go_terms', 'GO:0006955')": 118,
    "('go_terms', 75)": 119,
    "('go_terms', 'GO:0046536')": 119,
    "('go_terms', 76)": 120,
    "('go_terms', 'GO:1900017')": 120,
    "('go_terms', 77)": 121,
    "('go_terms', 'GO:0046872')": 121,
    "('go_terms', 78)": 122,
    "('go_terms', 'GO:0007605')": 122,
    "('go_terms', 79)": 123,
    "('go_terms', 'GO:0000373')": 123,
    "('go_terms', 80)": 124,
    "('go_terms', 'GO:0048255')": 124,
    "('go_terms', 81)": 125,
    "('go_terms', 'GO:0006417')": 125,
    "('go_terms', 82)": 126,
    "('go_terms', 'GO:0071391')": 126,
    "('go_terms', 83)": 127,
    "('go_terms', 'GO:0046677')": 127,
    "('go_terms', 84)": 128,
    "('go_terms', 'GO:0010042')": 128,
    "('go_terms', 85)": 129,
    "('go_terms', 'GO:0000172')": 129,
    "('go_terms', 86)": 130,
    "('go_terms', 'GO:0048027')": 130,
    "('go_terms', 87)": 131,
    "('go_terms', 'GO:0009113')": 131,
    "('go_terms', 88)": 132,
    "('go_terms', 'GO:0009408')": 132,
    "('go_terms', 89)": 133,
    "('go_terms', 'GO:0060291')": 133,
    "('go_terms', 90)": 134,
    "('go_terms', 'GO:0031402')": 134,
    "('go_terms', 91)": 135,
    "('go_terms', 'GO:0016032')": 135,
    "('go_terms', 92)": 136,
    "('go_terms', 'GO:0042382')": 136,
    "('go_terms', 93)": 137,
    "('go_terms', 'GO:0000289')": 137,
    "('go_terms', 94)": 138,
    "('go_terms', 'GO:0071480')": 138,
    "('go_terms', 95)": 139,
    "('go_terms', 'GO:0008150')": 139,
    "('go_terms', 96)": 140,
    "('go_terms', 'GO:0051169')": 140,
    "('go_terms', 97)": 141,
    "('go_terms', 'GO:1902679')": 141,
    "('go_terms', 98)": 142,
    "('go_terms', 'GO:0003723')": 142,
    "('go_terms', 99)": 143,
    "('go_terms', 'GO:0006412')": 143,
    "('go_terms', 100)": 144,
    "('go_terms', 'GO:0035438')": 144,
    "('go_terms', 101)": 145,
    "('go_terms', 'GO:0007004')": 145,
    "('go_terms', 102)": 146,
    "('go_terms', 'GO:0071230')": 146,
    "('go_terms', 103)": 147,
    "('go_terms', 'GO:0060908')": 147,
    "('go_terms', 104)": 148,
    "('go_terms', 'GO:0006446')": 148,
    "('go_terms', 105)": 149,
    "('go_terms', 'GO:0019856')": 149,
    "('go_terms', 106)": 150,
    "('go_terms', 'GO:0043066')": 150,
    "('go_terms', 107)": 151,
    "('go_terms', 'GO:0044650')": 151,
    "('go_terms', 108)": 152,
    "('go_terms', 'GO:1902617')": 152,
    "('go_terms', 109)": 153,
    "('go_terms', 'GO:0001896')": 153,
    "('go_terms', 110)": 154,
    "('go_terms', 'GO:0046661')": 154,
    "('go_terms', 111)": 155,
    "('go_terms', 'GO:0015855')": 155,
    "('go_terms', 112)": 156,
    "('go_terms', 'GO:0046660')": 156,
    "('go_terms', 113)": 157,
    "('go_terms', 'GO:0046500')": 157,
    "('go_terms', 114)": 158,
    "('go_terms', 'GO:0000333')": 158,
    "('go_terms', 115)": 159,
    "('go_terms', 'GO:0080183')": 159,
    "('go_terms', 116)": 160,
    "('go_terms', 'GO:0009048')": 160,
    "('go_terms', 117)": 161,
    "('go_terms', 'GO:0071260')": 161,
    "('go_terms', 118)": 162,
    "('go_terms', 'GO:0005687')": 162,
    "('go_terms', 119)": 163,
    "('go_terms', 'GO:0097311')": 163,
    "('go_terms', 120)": 164,
    "('go_terms', 'GO:0031556')": 164,
    "('go_terms', 121)": 165,
    "('go_terms', 'GO:1901698')": 165,
    "('go_terms', 122)": 166,
    "('go_terms', 'GO:0005575')": 166,
    "('go_terms', 123)": 167,
    "('go_terms', 'GO:0010181')": 167,
    "('go_terms', 124)": 168,
    "('go_terms', 'GO:0031047')": 168,
    "('go_terms', 125)": 169,
    "('go_terms', 'GO:0008595')": 169,
    "('go_terms', 126)": 170,
    "('go_terms', 'GO:0015976')": 170,
    "('go_terms', 127)": 171,
    "('go_terms', 'GO:0039705')": 171,
    "('go_terms', 128)": 172,
    "('go_terms', 'GO:0005634')": 172,
    "('go_terms', 129)": 173,
    "('go_terms', 'GO:0004526')": 173,
    "('go_terms', 130)": 174,
    "('go_terms', 'GO:0017148')": 174,
    "('go_terms', 131)": 175,
    "('go_terms', 'GO:0045013')": 175,
    "('go_terms', 132)": 176,
    "('go_terms', 'GO:0003743')": 176,
    "('go_terms', 133)": 177,
    "('go_terms', 'GO:0046498')": 177,
    "('go_terms', 134)": 178,
    "('go_terms', 'GO:0035195')": 178,
    "('go_terms', 135)": 179,
    "('go_terms', 'GO:0048501')": 179,
    "('go_terms', 136)": 180,
    "('go_terms', 'GO:0006396')": 180,
    "('go_terms', 137)": 181,
    "('go_terms', 'GO:0007391')": 181,
    "('go_terms', 138)": 182,
    "('go_terms', 'GO:0031554')": 182,
    "('go_terms', 139)": 183,
    "('go_terms', 'GO:0071333')": 183,
    "('go_terms', 140)": 184,
    "('go_terms', 'GO:0039580')": 184,
    "('go_terms', 141)": 185,
    "('go_terms', 'GO:0035194')": 185,
    "('go_terms', 142)": 186,
    "('go_terms', 'GO:0015030')": 186,
    "('go_terms', 143)": 187,
    "('go_terms', 'GO:0071732')": 187,
    "('go_terms', 144)": 188,
    "('go_terms', 'GO:0009267')": 188,
    "('go_terms', 145)": 189,
    "('go_terms', 'GO:0008616')": 189,
    "('go_terms', 146)": 190,
    "('go_terms', 'GO:0022610')": 190,
    "('go_terms', 147)": 191,
    "('go_terms', 'GO:0010629')": 191,
    "('go_terms', 148)": 192,
    "('go_terms', 'GO:0000105')": 192,
    "('go_terms', 149)": 193,
    "('go_terms', 'GO:0008298')": 193,
    "('go_terms', 150)": 194,
    "('go_terms', 'GO:1990830')": 194,
    "('go_terms', 151)": 195,
    "('go_terms', 'GO:0019079')": 195,
    "('go_terms', 152)": 196,
    "('go_terms', 'GO:1900376')": 196,
    "('go_terms', 153)": 197,
    "('go_terms', 'GO:0010628')": 197,
    "('go_terms', 154)": 198,
    "('go_terms', 'GO:2000145')": 198,
    "('go_terms', 155)": 199,
    "('go_terms', 'GO:0046653')": 199,
    "('go_terms', 156)": 200,
    "('go_terms', 'GO:0019080')": 200,
    "('go_terms', 157)": 201,
    "('go_terms', 'GO:0045814')": 201,
    "('go_terms', 158)": 202,
    "('go_terms', 'GO:0003323')": 202,
    "('go_terms', 159)": 203,
    "('go_terms', 'GO:1904322')": 203,
    "('go_terms', 160)": 204,
    "('go_terms', 'GO:0090729')": 204,
    "('go_terms', 161)": 205,
    "('go_terms', 'GO:0009299')": 205,
    "('go_terms', 162)": 206,
    "('go_terms', 'GO:0005623')": 206,
    "('go_terms', 163)": 207,
    "('go_terms', 'GO:0003824')": 207,
    "('go_terms', 164)": 208,
    "('go_terms', 'GO:0180001')": 208,
    "('go_terms', 165)": 209,
    "('go_terms', 'GO:0030627')": 209,
    "('go_terms', 166)": 210,
    "('go_terms', 'GO:0000353')": 210,
    "('go_terms', 167)": 211,
    "('go_terms', 'GO:0051819')": 211,
    "('go_terms', 168)": 212,
    "('go_terms', 'GO:0032774')": 212,
    "('go_terms', 169)": 213,
    "('go_terms', 'GO:0043555')": 213,
    "('go_terms', 170)": 214,
    "('go_terms', 'GO:0005690')": 214,
    "('go_terms', 171)": 215,
    "('go_terms', 'GO:1903295')": 215,
    "('go_terms', 172)": 216,
    "('go_terms', 'GO:0003735')": 216,
    "('go_terms', 173)": 217,
    "('go_terms', 'GO:1900363')": 217,
    "('go_terms', 174)": 218,
    "('go_terms', 'GO:0035278')": 218,
    "('go_terms', 175)": 219,
    "('go_terms', 'GO:0075523')": 219,
    "('go_terms', 176)": 220,
    "('go_terms', 'GO:0017070')": 220,
    "('go_terms', 177)": 221,
    "('go_terms', 'GO:0030145')": 221,
    "('go_terms', 178)": 222,
    "('go_terms', 'GO:0000395')": 222,
    "('go_terms', 179)": 223,
    "('go_terms', 'GO:0045182')": 223,
    "('go_terms', 180)": 224,
    "('go_terms', 'GO:0019074')": 224,
    "('go_terms', 181)": 225,
    "('go_terms', 'GO:0050779')": 225,
    "('go_terms', 182)": 226,
    "('go_terms', 'GO:0061157')": 226,
    "('go_terms', 183)": 227,
    "('go_terms', 'GO:0045892')": 227,
    "('go_terms', 184)": 228,
    "('go_terms', 'GO:0010109')": 228,
    "('go_terms', 185)": 229,
    "('go_terms', 'GO:0032057')": 229,
    "('go_terms', 186)": 230,
    "('go_terms', 'GO:0045599')": 230,
    "('go_terms', 187)": 231,
    "('go_terms', 'GO:0009617')": 231,
    "('go_terms', 188)": 232,
    "('go_terms', 'GO:0071978')": 232,
    "('go_terms', 189)": 233,
    "('go_terms', 'GO:0006109')": 233,
    "('go_terms', 190)": 234,
    "('go_terms', 'GO:0006382')": 234,
    "('go_terms', 191)": 235,
    "('go_terms', 'GO:0045131')": 235,
    "('go_terms', 192)": 236,
    "('go_terms', 'GO:0001745')": 236,
    "('go_terms', 193)": 237,
    "('go_terms', 'GO:0003720')": 237,
    "('go_terms', 194)": 238,
    "('go_terms', 'GO:0030681')": 238,
    "('go_terms', 195)": 239,
    "('go_terms', 'GO:0045974')": 239,
    "('go_terms', 196)": 240,
    "('go_terms', 'GO:0045975')": 240,
    "('go_terms', 197)": 241,
    "('go_terms', 'GO:0008049')": 241,
    "('go_terms', 198)": 242,
    "('go_terms', 'GO:0016607')": 242,
    "('go_terms', 199)": 243,
    "('go_terms', 'GO:1900268')": 243,
    "('go_terms', 200)": 244,
    "('go_terms', 'GO:0005730')": 244,
    "('go_terms', 201)": 245,
    "('go_terms', 'GO:0030680')": 245,
    "('go_terms', 202)": 246,
    "('go_terms', 'GO:0030631')": 246,
    "('go_terms', 203)": 247,
    "('go_terms', 'GO:0060259')": 247,
    "('go_terms', 204)": 248,
    "('go_terms', 'GO:0004478')": 248,
    "('go_terms', 205)": 249,
    "('go_terms', 'GO:0042478')": 249,
    "('go_terms', 206)": 250,
    "('go_terms', 'GO:0071241')": 250,
    "('go_terms', 207)": 251,
    "('go_terms', 'GO:0071222')": 251,
    "('go_terms', 208)": 252,
    "('go_terms', 'GO:0006413')": 252,
    "('go_terms', 209)": 253,
    "('go_terms', 'GO:0010039')": 253,
    "('go_terms', 210)": 254,
    "('go_terms', 'GO:0019069')": 254,
    "('go_terms', 211)": 255,
    "('go_terms', 'GO:0003676')": 255,
    "('go_terms', 212)": 256,
    "('go_terms', 'GO:0043484')": 256,
    "('go_terms', 213)": 257,
    "('go_terms', 'GO:0009098')": 257,
    "('go_terms', 214)": 258,
    "('go_terms', 'GO:0006338')": 258,
    "('go_terms', 215)": 259,
    "('go_terms', 'GO:0046782')": 259,
    "('go_terms', 216)": 260,
    "('go_terms', 'GO:0016055')": 260,
    "('go_terms', 217)": 261,
    "('go_terms', 'GO:0005737')": 261,
    "('go_terms', 218)": 262,
    "('go_terms', 'GO:0016442')": 262,
    "('go_terms', 219)": 263,
    "('go_terms', 'GO:0043934')": 263,
    "('go_terms', 220)": 264,
    "('go_terms', 'GO:0030533')": 264,
    "('go_terms', 221)": 265,
    "('go_terms', 'GO:0008359')": 265,
    "('go_terms', 222)": 266,
    "('go_terms', 'GO:0008033')": 266,
    "('go_terms', 223)": 267,
    "('go_terms', 'GO:0045893')": 267,
    "('go_terms', 224)": 268,
    "('go_terms', 'GO:0030151')": 268,
    "('go_terms', 225)": 269,
    "('go_terms', 'GO:0042981')": 269,
    "('go_terms', 226)": 270,
    "('go_terms', 'GO:0043488')": 270,
    "('go_terms', 227)": 271,
    "('go_terms', 'GO:0006403')": 271,
    "('go_terms', 228)": 272,
    "('go_terms', 'GO:0030647')": 272,
    "('go_terms', 229)": 273,
    "('go_terms', 'GO:0008258')": 273,
    "('go_terms', 230)": 274,
    "('go_terms', 'GO:0050897')": 274,
    "('go_terms', 231)": 275,
    "('go_terms', 'GO:0007569')": 275,
    "('go_terms', 232)": 276,
    "('go_terms', 'GO:0039689')": 276,
    "('go_terms', 233)": 277,
    "('go_terms', 'GO:0030900')": 277,
    "('go_terms', 234)": 278,
    "('go_terms', 'GO:0034198')": 278,
    "('go_terms', 235)": 279,
    "('go_terms', 'GO:0019081')": 279,
    "('go_terms', 236)": 280,
    "('go_terms', 'GO:0006545')": 280,
    "('go_terms', 237)": 281,
    "('go_terms', 'GO:0005686')": 281,
    "('go_terms', 238)": 282,
    "('go_terms', 'GO:0042868')": 282,
    "('go_terms', 239)": 283,
    "('go_terms', 'GO:0043590')": 283,
    "('go_terms', 240)": 284,
    "('go_terms', 'GO:0005691')": 284,
    "('go_terms', 241)": 285,
    "('go_terms', 'GO:0051726')": 285,
    "('go_terms', 242)": 286,
    "('go_terms', 'GO:0019072')": 286,
    "('go_terms', 243)": 287,
    "('go_terms', 'GO:0042749')": 287,
    "('go_terms', 244)": 288,
    "('go_terms', 'GO:0030976')": 288,
    "('go_terms', 245)": 289,
    "('go_terms', 'GO:0051028')": 289,
    "('go_terms', 246)": 290,
    "('go_terms', 'GO:0060910')": 290,
    "('go_terms', 247)": 291,
    "('go_terms', 'GO:0006364')": 291,
    "('go_terms', 248)": 292,
    "('go_terms', 'GO:0032546')": 292,
    "('go_terms', 249)": 293,
    "('go_terms', 'GO:2000147')": 293,
    "('go_terms', 250)": 294,
    "('go_terms', 'GO:0004540')": 294,
    "('go_terms', 251)": 295,
    "('go_terms', 'GO:0030621')": 295,
    "('go_terms', 252)": 296,
    "('go_terms', 'GO:0030308')": 296,
    "('go_terms', 253)": 297,
    "('go_terms', 'GO:0046540')": 297,
    "('go_terms', 254)": 298,
    "('go_terms', 'GO:0046549')": 298,
    "('go_terms', 255)": 299,
    "('go_terms', 'GO:0000244')": 299,
    "('go_terms', 256)": 300,
    "('go_terms', 'GO:0055065')": 300,
    "('go_terms', 257)": 301,
    "('go_terms', 'GO:0040033')": 301,
    "('go_terms', 258)": 302,
    "('go_terms', 'GO:0006617')": 302,
    "('go_terms', 259)": 303,
    "('go_terms', 'GO:0050728')": 303,
    "('go_terms', 260)": 304,
    "('go_terms', 'GO:0005739')": 304,
    "('go_terms', 261)": 305,
    "('go_terms', 'GO:0000162')": 305,
    "('go_terms', 262)": 306,
    "('go_terms', 'GO:0070482')": 306,
    "('go_terms', 263)": 307,
    "('go_terms', 'GO:0019044')": 307,
    "('go_terms', 264)": 308,
    "('go_terms', 'GO:0035094')": 308,
    "('go_terms', 265)": 309,
    "('go_terms', 'GO:0045069')": 309,
    "('go_terms', 266)": 310,
    "('go_terms', 'GO:0003674')": 310,
    "('go_terms', 267)": 311,
    "('go_terms', 'GO:0006398')": 311,
    "('go_terms', 268)": 312,
    "('go_terms', 'GO:0045451')": 312,
    "('go_terms', 269)": 313,
    "('go_terms', 'GO:0006979')": 313,
    "('go_terms', 270)": 314,
    "('go_terms', 'GO:0031507')": 314,
    "('go_terms', 271)": 315,
    "('go_terms', 'GO:0032055')": 315,
    "('go_terms', 272)": 316,
    "('go_terms', 'GO:0035282')": 316,
    "('go_terms', 273)": 317,
    "('go_terms', 'GO:0031419')": 317,
    "('go_terms', 274)": 318,
    "('go_terms', 'GO:0045786')": 318,
    "('go_terms', 275)": 319,
    "('go_terms', 'GO:0014850')": 319,
    "('go_terms', 276)": 320,
    "('go_terms', 'GO:0006353')": 320,
    "('go_terms', 277)": 321,
    "('go_terms', 'GO:0005692')": 321,
    "('go_terms', 278)": 322,
    "('go_terms', 'GO:0000365')": 322,
    "('go_terms', 279)": 323,
    "('go_terms', 'GO:0009266')": 323,
    "('go_terms', 280)": 324,
    "('go_terms', 'GO:0036294')": 324,
    "('go_terms', 281)": 325,
    "('go_terms', 'GO:0043487')": 325
  }
}