{
  "metadata": {
    "source_file": "training_data/processed/bert_ready_data.h5",
    "modalities": [
      "sequence",
      "ss",
      "consensus",
      "go_terms"
    ],
    "total_entries": 3978586
  },
  "modality_analyses": {
    "sequence": {
      "total_tokens": 408320698,
      "unique_tokens": 5,
      "token_frequencies": {
        "U": 109175777,
        "A": 107845354,
        "G": 98716810,
        "C": 92472600,
        "N": 110157
      },
      "length_stats": {
        "min": 19,
        "max": 1459,
        "mean": 102.62960207470694,
        "median": 104.0,
        "std": 51.42715006116703
      },
      "sample_tokens": [
        "U",
        "A",
        "N",
        "G",
        "C"
      ],
      "most_common_tokens": [
        [
          "U",
          109175777
        ],
        [
          "A",
          107845354
        ],
        [
          "G",
          98716810
        ],
        [
          "C",
          92472600
        ],
        [
          "N",
          110157
        ]
      ]
    },
    "ss": {
      "total_tokens": 408320698,
      "unique_tokens": 14,
      "token_frequencies": {
        "-": 80905929,
        "<": 73950167,
        ">": 73819233,
        "_": 60526760,
        ":": 60436607,
        ",": 16463102,
        "(": 12825340,
        ")": 12677602,
        ".": 8737578,
        "~": 5913823,
        "]": 775713,
        "[": 723002,
        "}": 285966,
        "{": 279876
      },
      "length_stats": {
        "min": 19,
        "max": 1459,
        "mean": 102.62960207470694,
        "median": 104.0,
        "std": 51.42715006116703
      },
      "sample_tokens": [
        "<",
        "{",
        ".",
        "_",
        "-",
        ":",
        "]",
        "~",
        "(",
        ",",
        "}",
        "[",
        ">",
        ")"
      ],
      "most_common_tokens": [
        [
          "-",
          80905929
        ],
        [
          "<",
          73950167
        ],
        [
          ">",
          73819233
        ],
        [
          "_",
          60526760
        ],
        [
          ":",
          60436607
        ],
        [
          ",",
          16463102
        ],
        [
          "(",
          12825340
        ],
        [
          ")",
          12677602
        ],
        [
          ".",
          8737578
        ],
        [
          "~",
          5913823
        ],
        [
          "]",
          775713
        ],
        [
          "[",
          723002
        ],
        [
          "}",
          285966
        ],
        [
          "{",
          279876
        ]
      ]
    },
    "consensus": {
      "total_tokens": 408320698,
      "unique_tokens": 10,
      "token_frequencies": {
        "A": 58709110,
        "g": 53606683,
        "U": 50453768,
        "G": 48874797,
        "c": 48605827,
        "C": 47881265,
        "u": 44208561,
        "a": 41329286,
        ".": 8737578,
        "~": 5913823
      },
      "length_stats": {
        "min": 19,
        "max": 1459,
        "mean": 102.62960207470694,
        "median": 104.0,
        "std": 51.42715006116703
      },
      "sample_tokens": [
        "c",
        ".",
        "a",
        "U",
        "A",
        "u",
        "~",
        "G",
        "C",
        "g"
      ],
      "most_common_tokens": [
        [
          "A",
          58709110
        ],
        [
          "g",
          53606683
        ],
        [
          "U",
          50453768
        ],
        [
          "G",
          48874797
        ],
        [
          "c",
          48605827
        ],
        [
          "C",
          47881265
        ],
        [
          "u",
          44208561
        ],
        [
          "a",
          41329286
        ],
        [
          ".",
          8737578
        ],
        [
          "~",
          5913823
        ]
      ]
    },
    "go_terms": {
      "total_tokens": 7199441,
      "unique_tokens": 280,
      "token_frequencies": {
        "0016442": 706991,
        "0035195": 706991,
        "0005730": 670913,
        "0006396": 670447,
        "0005840": 641889,
        "0003735": 641767,
        "0032197": 493311,
        "0004540": 333205,
        "0000244": 275918,
        "0000353": 265190,
        "0046540": 265190,
        "0005688": 204456,
        "0030621": 204456,
        "0000348": 73631,
        "0045131": 73631,
        "0005686": 71525,
        "0000373": 62289,
        "0006952": 55614,
        "0000395": 54652,
        "0030627": 54652,
        "0006398": 44596,
        "0010468": 44303,
        "0005685": 41329,
        "0006617": 36876,
        "0005687": 32194,
        "0017070": 32194,
        "0005682": 28540,
        "0005786": 24125,
        "0003824": 23406,
        "0031419": 21272,
        "0000049": 19443,
        "0030976": 16157,
        "0006382": 14095,
        "0048501": 13511,
        "0010039": 12325,
        "0035438": 10344,
        "0004526": 10023,
        "0008033": 10023,
        "0030680": 9647,
        "0015030": 9631,
        "0010629": 9593,
        "0006545": 9508,
        "0030533": 9329,
        "0005691": 9079,
        "0030622": 9079,
        "0180001": 7657,
        "0005515": 7123,
        "0010181": 6287,
        "0001514": 4970,
        "0010628": 4445,
        "0043022": 4283,
        "0009113": 4186,
        "0075523": 3915,
        "1900268": 3767,
        "0006417": 3738,
        "0046500": 3665,
        "1990830": 3369,
        "0039705": 3368,
        "0003729": 3334,
        "0006730": 3330,
        "1900371": 3330,
        "0009266": 3272,
        "0009085": 3242,
        "0019072": 3014,
        "0071230": 2787,
        "0005692": 2595,
        "0006452": 2502,
        "1902617": 2483,
        "0060291": 2255,
        "2001126": 2153,
        "0005693": 2106,
        "0006353": 2028,
        "1901698": 2028,
        "0006401": 1963,
        "0007605": 1929,
        "0071260": 1769,
        "0000365": 1693,
        "0005690": 1649,
        "0030624": 1649,
        "0017148": 1634,
        "0071333": 1544,
        "0015855": 1509,
        "0019856": 1509,
        "0046498": 1373,
        "0005634": 1321,
        "0031507": 1315,
        "0030151": 1294,
        "1901359": 1294,
        "1900376": 1265,
        "0045814": 1202,
        "0032026": 1150,
        "0030145": 1139,
        "0097311": 953,
        "0007569": 951,
        "0008616": 949,
        "0036386": 870,
        "0043590": 870,
        "0045974": 830,
        "0045893": 823,
        "0043934": 809,
        "0044403": 808,
        "0005623": 803,
        "0046660": 779,
        "0043488": 775,
        "0046653": 766,
        "0070482": 763,
        "0046661": 756,
        "0005737": 741,
        "0046549": 699,
        "0060041": 699,
        "0010467": 675,
        "0036294": 675,
        "2000648": 666,
        "0042382": 660,
        "0016055": 657,
        "0034198": 657,
        "0042478": 642,
        "0001896": 617,
        "0090729": 617,
        "0046336": 563,
        "0040033": 558,
        "0080183": 557,
        "0008049": 557,
        "0030631": 538,
        "0000333": 527,
        "0003720": 527,
        "0007004": 527,
        "1900363": 510,
        "0001708": 506,
        "0071222": 503,
        "0006412": 463,
        "0043487": 455,
        "0006446": 450,
        "0046677": 415,
        "0006520": 395,
        "0070406": 373,
        "0043066": 367,
        "0006338": 354,
        "0030681": 351,
        "0009877": 341,
        "0009617": 318,
        "0043555": 316,
        "0045786": 316,
        "0000105": 310,
        "0039694": 290,
        "0019079": 290,
        "0009299": 285,
        "0009372": 276,
        "0002060": 275,
        "0030371": 264,
        "0030900": 260,
        "0009048": 256,
        "0045182": 246,
        "0003674": 245,
        "0005575": 245,
        "0008150": 245,
        "0050897": 232,
        "0055065": 232,
        "0009267": 207,
        "0045727": 205,
        "0009088": 194,
        "0000162": 182,
        "0031556": 182,
        "0042981": 173,
        "0004478": 172,
        "0045947": 169,
        "0045975": 158,
        "0031402": 157,
        "0060910": 156,
        "1903295": 152,
        "0000900": 148,
        "0006109": 147,
        "2000147": 143,
        "0060548": 138,
        "0071480": 138,
        "0071391": 135,
        "0000289": 132,
        "1900017": 131,
        "0030308": 130,
        "0045013": 130,
        "0071241": 127,
        "1904322": 127,
        "0009098": 127,
        "0045596": 125,
        "0045599": 125,
        "0003323": 125,
        "0050779": 123,
        "0051726": 122,
        "0019074": 118,
        "0030488": 118,
        "0006113": 114,
        "0010109": 100,
        "0070063": 98,
        "0014850": 88,
        "0048255": 77,
        "0043484": 73,
        "0046782": 71,
        "0032055": 71,
        "0043629": 70,
        "0006099": 70,
        "0003723": 69,
        "0060908": 67,
        "0006979": 66,
        "0042542": 66,
        "0051090": 65,
        "0001745": 62,
        "0007391": 62,
        "0008258": 62,
        "0035094": 62,
        "0035282": 62,
        "0071732": 62,
        "0032057": 61,
        "0048027": 58,
        "0007298": 57,
        "0019069": 54,
        "0031047": 54,
        "0042868": 54,
        "1904973": 46,
        "0075139": 46,
        "0043158": 42,
        "0042749": 41,
        "0030647": 40,
        "0051169": 36,
        "0010608": 35,
        "0016607": 33,
        "0071978": 28,
        "0031554": 27,
        "0032546": 27,
        "0045069": 23,
        "0051028": 19,
        "0008298": 18,
        "0061157": 18,
        "0006403": 18,
        "0071234": 17,
        "0045451": 17,
        "0046536": 17,
        "0015797": 16,
        "0006413": 16,
        "0006521": 16,
        "0008359": 16,
        "0031369": 15,
        "0009407": 14,
        "0110001": 14,
        "0051168": 13,
        "0003676": 12,
        "0006955": 11,
        "0060259": 11,
        "1900191": 10,
        "0031123": 10,
        "0050728": 8,
        "0061014": 8,
        "0008595": 8,
        "0051701": 7,
        "0039703": 7,
        "0005739": 7,
        "0019044": 4,
        "0039580": 4,
        "0051819": 4,
        "0003743": 4,
        "0039689": 4,
        "1902680": 4,
        "0010042": 3,
        "0045892": 3,
        "0035278": 3,
        "0016032": 3,
        "0032774": 3,
        "0046872": 3,
        "0015976": 2,
        "0044650": 2,
        "2000145": 2,
        "0009399": 2,
        "0000171": 2,
        "0000172": 2,
        "0006364": 2,
        "0019081": 1,
        "1902679": 1,
        "0035194": 1,
        "0022610": 1,
        "0019080": 1,
        "0009408": 1
      },
      "length_stats": null,
      "sample_tokens": [
        "0003323",
        "0000289",
        "0070482",
        "0042868",
        "0090729",
        "0048501",
        "0045182",
        "0019072",
        "0061157",
        "0030976",
        "0005688",
        "0002060",
        "0006113",
        "0008298",
        "0005685",
        "0003676",
        "0046660",
        "0000395",
        "0009408",
        "1900371"
      ],
      "most_common_tokens": [
        [
          "0016442",
          706991
        ],
        [
          "0035195",
          706991
        ],
        [
          "0005730",
          670913
        ],
        [
          "0006396",
          670447
        ],
        [
          "0005840",
          641889
        ],
        [
          "0003735",
          641767
        ],
        [
          "0032197",
          493311
        ],
        [
          "0004540",
          333205
        ],
        [
          "0000244",
          275918
        ],
        [
          "0000353",
          265190
        ],
        [
          "0046540",
          265190
        ],
        [
          "0005688",
          204456
        ],
        [
          "0030621",
          204456
        ],
        [
          "0000348",
          73631
        ],
        [
          "0045131",
          73631
        ],
        [
          "0005686",
          71525
        ],
        [
          "0000373",
          62289
        ],
        [
          "0006952",
          55614
        ],
        [
          "0000395",
          54652
        ],
        [
          "0030627",
          54652
        ]
      ]
    }
  },
  "unified_vocabulary": {
    "token_to_idx": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "(": 5,
      ")": 6,
      ",": 7,
      "-": 8,
      ".": 9,
      "0000049": 10,
      "0000105": 11,
      "0000162": 12,
      "0000171": 13,
      "0000172": 14,
      "0000244": 15,
      "0000289": 16,
      "0000333": 17,
      "0000348": 18,
      "0000353": 19,
      "0000365": 20,
      "0000373": 21,
      "0000395": 22,
      "0000900": 23,
      "0001514": 24,
      "0001708": 25,
      "0001745": 26,
      "0001896": 27,
      "0002060": 28,
      "0003323": 29,
      "0003674": 30,
      "0003676": 31,
      "0003720": 32,
      "0003723": 33,
      "0003729": 34,
      "0003735": 35,
      "0003743": 36,
      "0003824": 37,
      "0004478": 38,
      "0004526": 39,
      "0004540": 40,
      "0005515": 41,
      "0005575": 42,
      "0005623": 43,
      "0005634": 44,
      "0005682": 45,
      "0005685": 46,
      "0005686": 47,
      "0005687": 48,
      "0005688": 49,
      "0005690": 50,
      "0005691": 51,
      "0005692": 52,
      "0005693": 53,
      "0005730": 54,
      "0005737": 55,
      "0005739": 56,
      "0005786": 57,
      "0005840": 58,
      "0006099": 59,
      "0006109": 60,
      "0006113": 61,
      "0006338": 62,
      "0006353": 63,
      "0006364": 64,
      "0006382": 65,
      "0006396": 66,
      "0006398": 67,
      "0006401": 68,
      "0006403": 69,
      "0006412": 70,
      "0006413": 71,
      "0006417": 72,
      "0006446": 73,
      "0006452": 74,
      "0006520": 75,
      "0006521": 76,
      "0006545": 77,
      "0006617": 78,
      "0006730": 79,
      "0006952": 80,
      "0006955": 81,
      "0006979": 82,
      "0007004": 83,
      "0007298": 84,
      "0007391": 85,
      "0007569": 86,
      "0007605": 87,
      "0008033": 88,
      "0008049": 89,
      "0008150": 90,
      "0008258": 91,
      "0008298": 92,
      "0008359": 93,
      "0008595": 94,
      "0008616": 95,
      "0009048": 96,
      "0009085": 97,
      "0009088": 98,
      "0009098": 99,
      "0009113": 100,
      "0009266": 101,
      "0009267": 102,
      "0009299": 103,
      "0009372": 104,
      "0009399": 105,
      "0009407": 106,
      "0009408": 107,
      "0009617": 108,
      "0009877": 109,
      "0010039": 110,
      "0010042": 111,
      "0010109": 112,
      "0010181": 113,
      "0010467": 114,
      "0010468": 115,
      "0010608": 116,
      "0010628": 117,
      "0010629": 118,
      "0014850": 119,
      "0015030": 120,
      "0015797": 121,
      "0015855": 122,
      "0015976": 123,
      "0016032": 124,
      "0016055": 125,
      "0016442": 126,
      "0016607": 127,
      "0017070": 128,
      "0017148": 129,
      "0019044": 130,
      "0019069": 131,
      "0019072": 132,
      "0019074": 133,
      "0019079": 134,
      "0019080": 135,
      "0019081": 136,
      "0019856": 137,
      "0022610": 138,
      "0030145": 139,
      "0030151": 140,
      "0030308": 141,
      "0030371": 142,
      "0030488": 143,
      "0030533": 144,
      "0030621": 145,
      "0030622": 146,
      "0030624": 147,
      "0030627": 148,
      "0030631": 149,
      "0030647": 150,
      "0030680": 151,
      "0030681": 152,
      "0030900": 153,
      "0030976": 154,
      "0031047": 155,
      "0031123": 156,
      "0031369": 157,
      "0031402": 158,
      "0031419": 159,
      "0031507": 160,
      "0031554": 161,
      "0031556": 162,
      "0032026": 163,
      "0032055": 164,
      "0032057": 165,
      "0032197": 166,
      "0032546": 167,
      "0032774": 168,
      "0034198": 169,
      "0035094": 170,
      "0035194": 171,
      "0035195": 172,
      "0035278": 173,
      "0035282": 174,
      "0035438": 175,
      "0036294": 176,
      "0036386": 177,
      "0039580": 178,
      "0039689": 179,
      "0039694": 180,
      "0039703": 181,
      "0039705": 182,
      "0040033": 183,
      "0042382": 184,
      "0042478": 185,
      "0042542": 186,
      "0042749": 187,
      "0042868": 188,
      "0042981": 189,
      "0043022": 190,
      "0043066": 191,
      "0043158": 192,
      "0043484": 193,
      "0043487": 194,
      "0043488": 195,
      "0043555": 196,
      "0043590": 197,
      "0043629": 198,
      "0043934": 199,
      "0044403": 200,
      "0044650": 201,
      "0045013": 202,
      "0045069": 203,
      "0045131": 204,
      "0045182": 205,
      "0045451": 206,
      "0045596": 207,
      "0045599": 208,
      "0045727": 209,
      "0045786": 210,
      "0045814": 211,
      "0045892": 212,
      "0045893": 213,
      "0045947": 214,
      "0045974": 215,
      "0045975": 216,
      "0046336": 217,
      "0046498": 218,
      "0046500": 219,
      "0046536": 220,
      "0046540": 221,
      "0046549": 222,
      "0046653": 223,
      "0046660": 224,
      "0046661": 225,
      "0046677": 226,
      "0046782": 227,
      "0046872": 228,
      "0048027": 229,
      "0048255": 230,
      "0048501": 231,
      "0050728": 232,
      "0050779": 233,
      "0050897": 234,
      "0051028": 235,
      "0051090": 236,
      "0051168": 237,
      "0051169": 238,
      "0051701": 239,
      "0051726": 240,
      "0051819": 241,
      "0055065": 242,
      "0060041": 243,
      "0060259": 244,
      "0060291": 245,
      "0060548": 246,
      "0060908": 247,
      "0060910": 248,
      "0061014": 249,
      "0061157": 250,
      "0070063": 251,
      "0070406": 252,
      "0070482": 253,
      "0071222": 254,
      "0071230": 255,
      "0071234": 256,
      "0071241": 257,
      "0071260": 258,
      "0071333": 259,
      "0071391": 260,
      "0071480": 261,
      "0071732": 262,
      "0071978": 263,
      "0075139": 264,
      "0075523": 265,
      "0080183": 266,
      "0090729": 267,
      "0097311": 268,
      "0110001": 269,
      "0180001": 270,
      "1900017": 271,
      "1900191": 272,
      "1900268": 273,
      "1900363": 274,
      "1900371": 275,
      "1900376": 276,
      "1901359": 277,
      "1901698": 278,
      "1902617": 279,
      "1902679": 280,
      "1902680": 281,
      "1903295": 282,
      "1904322": 283,
      "1904973": 284,
      "1990830": 285,
      "2000145": 286,
      "2000147": 287,
      "2000648": 288,
      "2001126": 289,
      ":": 290,
      "<": 291,
      ">": 292,
      "A": 293,
      "C": 294,
      "G": 295,
      "N": 296,
      "U": 297,
      "[": 298,
      "]": 299,
      "_": 300,
      "a": 301,
      "c": 302,
      "g": 303,
      "u": 304,
      "{": 305,
      "}": 306,
      "~": 307
    },
    "idx_to_token": {
      "0": "[PAD]",
      "1": "[UNK]",
      "2": "[CLS]",
      "3": "[SEP]",
      "4": "[MASK]",
      "5": "(",
      "6": ")",
      "7": ",",
      "8": "-",
      "9": ".",
      "10": "0000049",
      "11": "0000105",
      "12": "0000162",
      "13": "0000171",
      "14": "0000172",
      "15": "0000244",
      "16": "0000289",
      "17": "0000333",
      "18": "0000348",
      "19": "0000353",
      "20": "0000365",
      "21": "0000373",
      "22": "0000395",
      "23": "0000900",
      "24": "0001514",
      "25": "0001708",
      "26": "0001745",
      "27": "0001896",
      "28": "0002060",
      "29": "0003323",
      "30": "0003674",
      "31": "0003676",
      "32": "0003720",
      "33": "0003723",
      "34": "0003729",
      "35": "0003735",
      "36": "0003743",
      "37": "0003824",
      "38": "0004478",
      "39": "0004526",
      "40": "0004540",
      "41": "0005515",
      "42": "0005575",
      "43": "0005623",
      "44": "0005634",
      "45": "0005682",
      "46": "0005685",
      "47": "0005686",
      "48": "0005687",
      "49": "0005688",
      "50": "0005690",
      "51": "0005691",
      "52": "0005692",
      "53": "0005693",
      "54": "0005730",
      "55": "0005737",
      "56": "0005739",
      "57": "0005786",
      "58": "0005840",
      "59": "0006099",
      "60": "0006109",
      "61": "0006113",
      "62": "0006338",
      "63": "0006353",
      "64": "0006364",
      "65": "0006382",
      "66": "0006396",
      "67": "0006398",
      "68": "0006401",
      "69": "0006403",
      "70": "0006412",
      "71": "0006413",
      "72": "0006417",
      "73": "0006446",
      "74": "0006452",
      "75": "0006520",
      "76": "0006521",
      "77": "0006545",
      "78": "0006617",
      "79": "0006730",
      "80": "0006952",
      "81": "0006955",
      "82": "0006979",
      "83": "0007004",
      "84": "0007298",
      "85": "0007391",
      "86": "0007569",
      "87": "0007605",
      "88": "0008033",
      "89": "0008049",
      "90": "0008150",
      "91": "0008258",
      "92": "0008298",
      "93": "0008359",
      "94": "0008595",
      "95": "0008616",
      "96": "0009048",
      "97": "0009085",
      "98": "0009088",
      "99": "0009098",
      "100": "0009113",
      "101": "0009266",
      "102": "0009267",
      "103": "0009299",
      "104": "0009372",
      "105": "0009399",
      "106": "0009407",
      "107": "0009408",
      "108": "0009617",
      "109": "0009877",
      "110": "0010039",
      "111": "0010042",
      "112": "0010109",
      "113": "0010181",
      "114": "0010467",
      "115": "0010468",
      "116": "0010608",
      "117": "0010628",
      "118": "0010629",
      "119": "0014850",
      "120": "0015030",
      "121": "0015797",
      "122": "0015855",
      "123": "0015976",
      "124": "0016032",
      "125": "0016055",
      "126": "0016442",
      "127": "0016607",
      "128": "0017070",
      "129": "0017148",
      "130": "0019044",
      "131": "0019069",
      "132": "0019072",
      "133": "0019074",
      "134": "0019079",
      "135": "0019080",
      "136": "0019081",
      "137": "0019856",
      "138": "0022610",
      "139": "0030145",
      "140": "0030151",
      "141": "0030308",
      "142": "0030371",
      "143": "0030488",
      "144": "0030533",
      "145": "0030621",
      "146": "0030622",
      "147": "0030624",
      "148": "0030627",
      "149": "0030631",
      "150": "0030647",
      "151": "0030680",
      "152": "0030681",
      "153": "0030900",
      "154": "0030976",
      "155": "0031047",
      "156": "0031123",
      "157": "0031369",
      "158": "0031402",
      "159": "0031419",
      "160": "0031507",
      "161": "0031554",
      "162": "0031556",
      "163": "0032026",
      "164": "0032055",
      "165": "0032057",
      "166": "0032197",
      "167": "0032546",
      "168": "0032774",
      "169": "0034198",
      "170": "0035094",
      "171": "0035194",
      "172": "0035195",
      "173": "0035278",
      "174": "0035282",
      "175": "0035438",
      "176": "0036294",
      "177": "0036386",
      "178": "0039580",
      "179": "0039689",
      "180": "0039694",
      "181": "0039703",
      "182": "0039705",
      "183": "0040033",
      "184": "0042382",
      "185": "0042478",
      "186": "0042542",
      "187": "0042749",
      "188": "0042868",
      "189": "0042981",
      "190": "0043022",
      "191": "0043066",
      "192": "0043158",
      "193": "0043484",
      "194": "0043487",
      "195": "0043488",
      "196": "0043555",
      "197": "0043590",
      "198": "0043629",
      "199": "0043934",
      "200": "0044403",
      "201": "0044650",
      "202": "0045013",
      "203": "0045069",
      "204": "0045131",
      "205": "0045182",
      "206": "0045451",
      "207": "0045596",
      "208": "0045599",
      "209": "0045727",
      "210": "0045786",
      "211": "0045814",
      "212": "0045892",
      "213": "0045893",
      "214": "0045947",
      "215": "0045974",
      "216": "0045975",
      "217": "0046336",
      "218": "0046498",
      "219": "0046500",
      "220": "0046536",
      "221": "0046540",
      "222": "0046549",
      "223": "0046653",
      "224": "0046660",
      "225": "0046661",
      "226": "0046677",
      "227": "0046782",
      "228": "0046872",
      "229": "0048027",
      "230": "0048255",
      "231": "0048501",
      "232": "0050728",
      "233": "0050779",
      "234": "0050897",
      "235": "0051028",
      "236": "0051090",
      "237": "0051168",
      "238": "0051169",
      "239": "0051701",
      "240": "0051726",
      "241": "0051819",
      "242": "0055065",
      "243": "0060041",
      "244": "0060259",
      "245": "0060291",
      "246": "0060548",
      "247": "0060908",
      "248": "0060910",
      "249": "0061014",
      "250": "0061157",
      "251": "0070063",
      "252": "0070406",
      "253": "0070482",
      "254": "0071222",
      "255": "0071230",
      "256": "0071234",
      "257": "0071241",
      "258": "0071260",
      "259": "0071333",
      "260": "0071391",
      "261": "0071480",
      "262": "0071732",
      "263": "0071978",
      "264": "0075139",
      "265": "0075523",
      "266": "0080183",
      "267": "0090729",
      "268": "0097311",
      "269": "0110001",
      "270": "0180001",
      "271": "1900017",
      "272": "1900191",
      "273": "1900268",
      "274": "1900363",
      "275": "1900371",
      "276": "1900376",
      "277": "1901359",
      "278": "1901698",
      "279": "1902617",
      "280": "1902679",
      "281": "1902680",
      "282": "1903295",
      "283": "1904322",
      "284": "1904973",
      "285": "1990830",
      "286": "2000145",
      "287": "2000147",
      "288": "2000648",
      "289": "2001126",
      "290": ":",
      "291": "<",
      "292": ">",
      "293": "A",
      "294": "C",
      "295": "G",
      "296": "N",
      "297": "U",
      "298": "[",
      "299": "]",
      "300": "_",
      "301": "a",
      "302": "c",
      "303": "g",
      "304": "u",
      "305": "{",
      "306": "}",
      "307": "~"
    },
    "vocab_size": 308,
    "modality_token_mapping": {
      "sequence": [
        "U",
        "A",
        "N",
        "G",
        "C"
      ],
      "ss": [
        "<",
        "{",
        ".",
        "_",
        "-",
        ":",
        "]",
        "~",
        "(",
        ",",
        "}",
        "[",
        ">",
        ")"
      ],
      "consensus": [
        "c",
        ".",
        "a",
        "U",
        "A",
        "u",
        "~",
        "G",
        "C",
        "g"
      ],
      "go_terms": [
        "0003323",
        "0000289",
        "0070482",
        "0042868",
        "0090729",
        "0048501",
        "0045182",
        "0019072",
        "0061157",
        "0030976",
        "0005688",
        "0002060",
        "0006113",
        "0008298",
        "0005685",
        "0003676",
        "0046660",
        "0000395",
        "0009408",
        "1900371",
        "0045013",
        "0000162",
        "0006417",
        "0019044",
        "0006403",
        "0009048",
        "1990830",
        "0006452",
        "0017070",
        "0010039",
        "0005693",
        "0000373",
        "0016607",
        "0008150",
        "2000648",
        "0014850",
        "0015976",
        "0000353",
        "0071241",
        "0071222",
        "0015855",
        "0015030",
        "0030681",
        "0035282",
        "1900191",
        "0019081",
        "0008258",
        "2001126",
        "0048027",
        "0005786",
        "1900376",
        "0009407",
        "0045069",
        "0003720",
        "0017148",
        "0007391",
        "0006730",
        "0070063",
        "0016055",
        "0000900",
        "0048255",
        "0007298",
        "0043555",
        "0042478",
        "0043934",
        "0003674",
        "0006521",
        "0031419",
        "0005623",
        "0006353",
        "0009085",
        "0045814",
        "0045596",
        "0032546",
        "0016442",
        "0030624",
        "0005690",
        "0045786",
        "0015797",
        "0005687",
        "1902680",
        "0001745",
        "0030151",
        "0040033",
        "0030371",
        "0004478",
        "0006364",
        "0031402",
        "0019080",
        "0055065",
        "0030627",
        "0001896",
        "0009877",
        "0071333",
        "0034198",
        "0043590",
        "0006338",
        "0009267",
        "0010629",
        "0010628",
        "0045974",
        "1904322",
        "0003723",
        "0046653",
        "0005686",
        "0032055",
        "0031554",
        "0046782",
        "0031123",
        "0006955",
        "0005739",
        "0060910",
        "0006412",
        "0000365",
        "0039689",
        "0071391",
        "0008359",
        "0006617",
        "0005515",
        "0001708",
        "0050779",
        "0006398",
        "0030488",
        "0039703",
        "0071234",
        "0007004",
        "0006099",
        "0003743",
        "0044650",
        "0046549",
        "0043629",
        "0043158",
        "0009113",
        "0009266",
        "0006396",
        "1904973",
        "0030680",
        "0075523",
        "0000105",
        "0019069",
        "1902679",
        "0004526",
        "0008616",
        "0035194",
        "0005692",
        "0019856",
        "1900363",
        "0032774",
        "0030308",
        "0180001",
        "0071732",
        "0005840",
        "0032026",
        "0046661",
        "0043487",
        "0030533",
        "0010042",
        "0035278",
        "0045892",
        "0039694",
        "0006413",
        "0045975",
        "0030900",
        "0030145",
        "0046336",
        "1903295",
        "0010468",
        "0043488",
        "0043484",
        "0071480",
        "0010181",
        "0006109",
        "0005634",
        "0045599",
        "0045451",
        "0007569",
        "0031369",
        "0042542",
        "0080183",
        "0004540",
        "0051726",
        "1900017",
        "0050728",
        "0061014",
        "0003824",
        "0009088",
        "0000172",
        "0006520",
        "0007605",
        "0071260",
        "0035195",
        "0000333",
        "0097311",
        "0010109",
        "0046677",
        "0009299",
        "0042981",
        "0046536",
        "0009617",
        "0035438",
        "0005737",
        "0045893",
        "0010608",
        "0031507",
        "0110001",
        "0051168",
        "0044403",
        "1902617",
        "0050897",
        "0006979",
        "0005730",
        "0030622",
        "0036294",
        "0006952",
        "0006382",
        "0042382",
        "0003735",
        "0046500",
        "1901698",
        "0010467",
        "0060908",
        "0030621",
        "0000171",
        "0043066",
        "0046872",
        "0006446",
        "0030631",
        "0005682",
        "0071978",
        "2000145",
        "0006545",
        "0009098",
        "0046540",
        "0008049",
        "0031047",
        "1900268",
        "0009372",
        "0030647",
        "0035094",
        "2000147",
        "0043022",
        "0046498",
        "0000348",
        "0045131",
        "0008595",
        "1901359",
        "0060259",
        "0008033",
        "0060041",
        "0019079",
        "0005691",
        "0060548",
        "0042749",
        "0005575",
        "0001514",
        "0045947",
        "0016032",
        "0039705",
        "0045727",
        "0006401",
        "0031556",
        "0036386",
        "0000244",
        "0060291",
        "0070406",
        "0003729",
        "0009399",
        "0075139",
        "0039580",
        "0051028",
        "0032197",
        "0032057",
        "0051819",
        "0051169",
        "0071230",
        "0000049",
        "0022610",
        "0051701",
        "0051090",
        "0019074"
      ]
    },
    "special_tokens": [
      "[PAD]",
      "[UNK]",
      "[CLS]",
      "[SEP]",
      "[MASK]"
    ],
    "modality_sizes": {
      "sequence": 5,
      "ss": 14,
      "consensus": 10,
      "go_terms": 280
    }
  },
  "cross_modality_overlap": {
    "overlap_matrix": {
      "sequence": {
        "sequence": 1.0,
        "ss": 0.0,
        "consensus": 0.36363636363636365,
        "go_terms": 0.0
      },
      "ss": {
        "sequence": 0.0,
        "ss": 1.0,
        "consensus": 0.09090909090909091,
        "go_terms": 0.0
      },
      "consensus": {
        "sequence": 0.36363636363636365,
        "ss": 0.09090909090909091,
        "consensus": 1.0,
        "go_terms": 0.0
      },
      "go_terms": {
        "sequence": 0.0,
        "ss": 0.0,
        "consensus": 0.0,
        "go_terms": 1.0
      }
    },
    "overlap_details": {
      "sequence": {
        "sequence": {
          "overlap_tokens": [
            "U",
            "A",
            "N",
            "G",
            "C"
          ],
          "overlap_count": 5
        },
        "ss": {
          "overlap_tokens": [],
          "overlap_count": 0,
          "jaccard_similarity": 0.0
        },
        "consensus": {
          "overlap_tokens": [
            "G",
            "U",
            "C",
            "A"
          ],
          "overlap_count": 4,
          "jaccard_similarity": 0.36363636363636365
        },
        "go_terms": {
          "overlap_tokens": [],
          "overlap_count": 0,
          "jaccard_similarity": 0.0
        }
      },
      "ss": {
        "sequence": {
          "overlap_tokens": [],
          "overlap_count": 0,
          "jaccard_similarity": 0.0
        },
        "ss": {
          "overlap_tokens": [
            "<",
            "{",
            ".",
            "_",
            "-",
            ":",
            "]",
            "~",
            "(",
            ",",
            "}",
            "[",
            ">",
            ")"
          ],
          "overlap_count": 14
        },
        "consensus": {
          "overlap_tokens": [
            ".",
            "~"
          ],
          "overlap_count": 2,
          "jaccard_similarity": 0.09090909090909091
        },
        "go_terms": {
          "overlap_tokens": [],
          "overlap_count": 0,
          "jaccard_similarity": 0.0
        }
      },
      "consensus": {
        "sequence": {
          "overlap_tokens": [
            "G",
            "U",
            "C",
            "A"
          ],
          "overlap_count": 4,
          "jaccard_similarity": 0.36363636363636365
        },
        "ss": {
          "overlap_tokens": [
            ".",
            "~"
          ],
          "overlap_count": 2,
          "jaccard_similarity": 0.09090909090909091
        },
        "consensus": {
          "overlap_tokens": [
            "c",
            ".",
            "a",
            "U",
            "A",
            "u",
            "~",
            "G",
            "C",
            "g"
          ],
          "overlap_count": 10
        },
        "go_terms": {
          "overlap_tokens": [],
          "overlap_count": 0,
          "jaccard_similarity": 0.0
        }
      },
      "go_terms": {
        "sequence": {
          "overlap_tokens": [],
          "overlap_count": 0,
          "jaccard_similarity": 0.0
        },
        "ss": {
          "overlap_tokens": [],
          "overlap_count": 0,
          "jaccard_similarity": 0.0
        },
        "consensus": {
          "overlap_tokens": [],
          "overlap_count": 0,
          "jaccard_similarity": 0.0
        },
        "go_terms": {
          "overlap_tokens": [
            "0003323",
            "0000289",
            "0070482",
            "0042868",
            "0090729",
            "0048501",
            "0045182",
            "0019072",
            "0061157",
            "0030976",
            "0005688",
            "0002060",
            "0006113",
            "0008298",
            "0005685",
            "0003676",
            "0046660",
            "0000395",
            "0009408",
            "1900371",
            "0045013",
            "0000162",
            "0006417",
            "0019044",
            "0006403",
            "0009048",
            "1990830",
            "0006452",
            "0017070",
            "0010039",
            "0005693",
            "0000373",
            "0016607",
            "0008150",
            "2000648",
            "0014850",
            "0015976",
            "0000353",
            "0071241",
            "0071222",
            "0015855",
            "0015030",
            "0030681",
            "0035282",
            "1900191",
            "0019081",
            "0008258",
            "2001126",
            "0048027",
            "0005786",
            "1900376",
            "0009407",
            "0045069",
            "0003720",
            "0017148",
            "0007391",
            "0006730",
            "0070063",
            "0016055",
            "0000900",
            "0048255",
            "0007298",
            "0043555",
            "0042478",
            "0043934",
            "0003674",
            "0006521",
            "0031419",
            "0005623",
            "0006353",
            "0009085",
            "0045814",
            "0045596",
            "0032546",
            "0016442",
            "0030624",
            "0005690",
            "0045786",
            "0015797",
            "0005687",
            "1902680",
            "0001745",
            "0030151",
            "0040033",
            "0030371",
            "0004478",
            "0006364",
            "0031402",
            "0019080",
            "0055065",
            "0030627",
            "0001896",
            "0009877",
            "0071333",
            "0034198",
            "0043590",
            "0006338",
            "0009267",
            "0010629",
            "0010628",
            "0045974",
            "1904322",
            "0003723",
            "0046653",
            "0005686",
            "0032055",
            "0031554",
            "0046782",
            "0031123",
            "0006955",
            "0005739",
            "0060910",
            "0006412",
            "0000365",
            "0039689",
            "0071391",
            "0008359",
            "0006617",
            "0005515",
            "0001708",
            "0050779",
            "0006398",
            "0030488",
            "0039703",
            "0071234",
            "0007004",
            "0006099",
            "0003743",
            "0044650",
            "0046549",
            "0043629",
            "0043158",
            "0009113",
            "0009266",
            "0006396",
            "1904973",
            "0030680",
            "0075523",
            "0000105",
            "0019069",
            "1902679",
            "0004526",
            "0008616",
            "0035194",
            "0005692",
            "0019856",
            "1900363",
            "0032774",
            "0030308",
            "0180001",
            "0071732",
            "0005840",
            "0032026",
            "0046661",
            "0043487",
            "0030533",
            "0010042",
            "0035278",
            "0045892",
            "0039694",
            "0006413",
            "0045975",
            "0030900",
            "0030145",
            "0046336",
            "1903295",
            "0010468",
            "0043488",
            "0043484",
            "0071480",
            "0010181",
            "0006109",
            "0005634",
            "0045599",
            "0045451",
            "0007569",
            "0031369",
            "0042542",
            "0080183",
            "0004540",
            "0051726",
            "1900017",
            "0050728",
            "0061014",
            "0003824",
            "0009088",
            "0000172",
            "0006520",
            "0007605",
            "0071260",
            "0035195",
            "0000333",
            "0097311",
            "0010109",
            "0046677",
            "0009299",
            "0042981",
            "0046536",
            "0009617",
            "0035438",
            "0005737",
            "0045893",
            "0010608",
            "0031507",
            "0110001",
            "0051168",
            "0044403",
            "1902617",
            "0050897",
            "0006979",
            "0005730",
            "0030622",
            "0036294",
            "0006952",
            "0006382",
            "0042382",
            "0003735",
            "0046500",
            "1901698",
            "0010467",
            "0060908",
            "0030621",
            "0000171",
            "0043066",
            "0046872",
            "0006446",
            "0030631",
            "0005682",
            "0071978",
            "2000145",
            "0006545",
            "0009098",
            "0046540",
            "0008049",
            "0031047",
            "1900268",
            "0009372",
            "0030647",
            "0035094",
            "2000147",
            "0043022",
            "0046498",
            "0000348",
            "0045131",
            "0008595",
            "1901359",
            "0060259",
            "0008033",
            "0060041",
            "0019079",
            "0005691",
            "0060548",
            "0042749",
            "0005575",
            "0001514",
            "0045947",
            "0016032",
            "0039705",
            "0045727",
            "0006401",
            "0031556",
            "0036386",
            "0000244",
            "0060291",
            "0070406",
            "0003729",
            "0009399",
            "0075139",
            "0039580",
            "0051028",
            "0032197",
            "0032057",
            "0051819",
            "0051169",
            "0071230",
            "0000049",
            "0022610",
            "0051701",
            "0051090",
            "0019074"
          ],
          "overlap_count": 280
        }
      }
    }
  }
}